In [1]:
a=10
b=20
a+b

30

# ====================================  EDA   ================================
1) Pandas : Data frame applications
    
2) Numpy : Numerical python All math applications
    
3)Matplotlib : used for plotting
    
4)Seaborn : used for plot
    
==== Mainly we use these 4 for EDA ==========
    
5)plotly : used for plot
    
6)Bokhe : used for plot
    
 ====================================== Machine Learning ==========================
7)Sickit-learn: sklearn
    
======================================= Deep Learning ================================
8)Tensorflow : Google 
    
9)Keras      : Google
    
10)Pytorch   : FaceBook
    
==================================== NLP =====================================
11) NLTK : Natural Language tool kit
    
12)Scipy

===================================== BERT =====================================
13)Transformers : Hugging face (Google)
    
=================================== Google models ==============================
14) Specific Google packages

=================================== Azure ML ======================================
15)Azure packages

===================================== GenAI =================================================
16) Gemini : Google
    
17) chatgpt : OpenAi
    
=================================== LangChain ===============================================
18) LangChain packages

# Create a dataframe using list

In [ ]:
list ============= dictonary

dictonary =============== list

# $step1 - Creating empty dataFrames

In [3]:
import pandas as pd
names = ['Ayush','Rishi','preth']
pd.DataFrame() #empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

# step2 - provide the data

In [8]:
names = ['Ayush','Rishi','preth']
pd.DataFrame(names)

       0
0  Ayush
1  Rishi
2  preth

In [12]:
names = ['Ayush','Rishi','preth']
marks = [1,6,7]
pd.DataFrame(zip(names,marks))
#what is the first positional argument : data
#second positional argument : index

       0  1
0  Ayush  1
1  Rishi  6
2  preth  7

In [15]:
 fruits = ['apple','mango','orange']
weight = [45,76,55]
city = ['hyd','mumbai','bangalore']
pd.DataFrame(zip(fruits,weight),city)

                0   1
hyd         apple  45
mumbai      mango  76
bangalore  orange  55

# step3 - Provide the columns

In [18]:
names = ['Ayush','Rishi','preth']
marks = [1,6,7]
pd.DataFrame(zip(names,marks), ['Names','Age','other'])

           0  1
Names  Ayush  1
Age    Rishi  6
other  preth  7

In [16]:
names = ['Ayush','Rishi','preth']
marks = [1,6,7]
pd.DataFrame(zip(names,marks),columns = ['Names','Age'])

   Names  Age
0  Ayush    1
1  Rishi    6
2  preth    7

In [20]:
names = ['Ayush','Rishi','preth']
marks = [1,6,7]
location = ['home','office','residence']
pd.DataFrame(zip(names,marks,location),columns = ['Names','Age','location'])

   Names  Age   location
0  Ayush    1       home
1  Rishi    6     office
2  preth    7  residence

In [28]:
names = ['Ayush','Rishi','preth']
marks = [1,6,7]
location = ['home','office','residence']
data = zip(names,marks,location)
cols = ['Names','Age','location']
df = pd.DataFrame(data,columns=cols)

In [27]:
type(df)

pandas.core.frame.DataFrame

# Step4 - ADD new column

 -If you want to add new column first

-you need to check the number of rows in already existed data

-For example in above the dataFrame has 3 rows

-You need to create a new list with 3 rows

-that list equate to the dataframe

In [30]:
job = ['DS','DE','CS']
df['JOB'] = job
df

   Names  Age   location JOB
0  Ayush    1       home  DS
1  Rishi    6     office  DE
2  preth    7  residence  CS

In [32]:
salary = ['15k','20k','30k']
df['SALARY'] = salary
df

   Names  Age   location JOB SALARY
0  Ayush    1       home  DS    15k
1  Rishi    6     office  DE    20k
2  preth    7  residence  CS    30k

# Step5 -Update the already Existed Column

- Create new column and update already existing column

In [33]:
df['Age'] = [35,28,30]
df

   Names  Age   location JOB SALARY
0  Ayush   35       home  DS    15k
1  Rishi   28     office  DE    20k
2  preth   30  residence  CS    30k

# Step6 - change the index

In [37]:
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

# Note:

-Number of list equals to Number of rows

-Number of values inside list equals to Number of rows

-When you create the data all the list will be in the same length

# Step7 - Shape 

-Number of rows and Number of columns

In [42]:
df.shape

(4, 3)

In [40]:
df.shape
#Matrix format
#4 rows and 3 columns
print("the number of rows are :",df.shape[0])
print("the number of columns are :",df.shape[1])

the number of rows are : 4
the number of columns are : 3

# Step8 - Drop columns

-In order to drop the columns , we require 3 columns

-Column name

 -The Column name we need to mention
 
-axis

 -axis = 0 **represents rows**
 
 -axis = 1 **represents columns**
 
-inplace

 -we are dropping the columns means,we are modifying the data Frame
 
 - so this modifications we want to save in same variable or different variable
 
 -If you want to keep in the same variable the **inplace = True**

In [60]:
df

   Age
A    1
B    6
C    7
D    9

In [62]:
if 'Names' in df.columns:
    df = df.drop(columns=['Names'])

In [63]:
df

   Age
A    1
B    6
C    7
D    9

In [65]:
df

   Age
A    1
B    6
C    7
D    9

In [66]:
if 'Age' in df.columns:
    df = df.drop(columns=['Age'])

In [67]:
df

Empty DataFrame
Columns: []
Index: [A, B, C, D]

In [72]:
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

In [69]:
df.drop('location',axis=1,inplace=True)

In [70]:
df

   Names  Age
A  Ayush    1
B  Rishi    6
C  preth    7
D   Abhi    9

In [73]:
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

In [74]:
df.drop('location',axis=1,inplace=False)

   Names  Age
A  Ayush    1
B  Rishi    6
C  preth    7
D   Abhi    9

In [75]:
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

# Step9 - Multiple Columns drop

In [76]:
#again read the data
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

In [77]:
df.drop(['Age','location'],axis=1,inplace=True)

In [78]:
df

   Names
A  Ayush
B  Rishi
C  preth
D   Abhi

# Step10 - Drop Rows

In [79]:
#again read the data
names = ['Ayush','Rishi','preth','Abhi']
marks = [1,6,7,9]
location = ['home','office','residence','state']
data = zip(names,marks,location)
cols = ['Names','Age','location']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns=cols)
df

   Names  Age   location
A  Ayush    1       home
B  Rishi    6     office
C  preth    7  residence
D   Abhi    9      state

In [82]:
df.drop('A',axis=0,inplace=True)

In [83]:
df

   Names  Age
B  Rishi    6
C  preth    7
D   Abhi    9

# Step11 - how to save the dataFrame in Local

-Generally dataFrames are two types

-csv(comma separated values)

-excel

In [87]:
#file name = data
#extention = csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [89]:
#extension = .xlsx
df.to_excel('data2.xlsx')
df.to_excel('data3.xlsx',index=False)